(3)
CREATE TABLE user (
    id VARCHAR(10), 
    name VARCHAR(255), 
    sex VARCHAR(10),   
    age INT,       
    phone VARCHAR(10)    
);

INSERT INTO user (id, name, sex, age, phone)
VALUES
    (1, '张三', '男', 25, '123-456-7890'),
    (2, '李四', '女', 30, '987-654-3210'),
    (3, '王五', '男', 22, '555-555-5555');

(4)
SELECT * FROM user
WHERE age BETWEEN 20 AND 30

(5)
DELETE FROM user 
WHERE name LIKE ‘%张%'

(6)
SELECT AVG(age) FROM user;

(7)
SELECT * FROM user 
WHERE age >= 20 AND age <= 30 AND name LIKE '%张%'
ORDER BY age, DESC;

(8)
CREATE TABLE team (
    id INT,
    teamName VARCHAR(255) 
);

CREATE TABLE score (
    id INT,
    teamid INT,
    userid INT,
    score INT,
    FOREIGN KEY (teamid) REFERENCES team(id),
    FOREIGN KEY (userid) REFERENCES user(id)
);

(9)
SELECT * FROM user
JOIN team ON user.teamid = team.id
WHERE team.teamName = 'ECNU' AND user.age < 20;

(10)
SELECT team.teamName, COALESCE(SUM(score.score), 0) AS total_score
FROM team
LEFT JOIN score ON team.id = score.teamid
WHERE team.teamName = 'ECNU'
GROUP BY team.teamName;